Repository: Mmi257ia/linux_appdev
Catalog: 11_Documenting/po/*.po
Languages: ru

source: Number %d is too big to convert it to Roman
ru: Число %d слишком велико для перевода в римскую систему счисления

source: Can't convert character %c from Roman to decimal number
ru: Невозможно перевести букву %c из римской системы счисления в десятичную

source: Usage:
ru: Использование:

source: [OPTION...]
ru: [ПАРАМЕТР...]

source: Give a short usage message
ru: Вывести короткую подсказку

source: Give this help list
ru: Вывести эту подсказку

source: Use roman numbers
ru: Использовать римские цифры

source: Numbers guesser.vSupported languages: English, Russian.
ru: Угадыватель чисел.vПоддерживаемые языки: английский, русский.

source: Yes
ru: Да

source: No
ru: Нет

source: Guess a number between %s and %s.
ru: Загадайте число между %s и %s.

source: Guess a number between %d and %d.
ru: Загадайте число между %d и %d.

source: Is the guessed number greater than %s? (%s/%s)
ru: Загаданное число больше %s? (%s/%s)

source: Is the guessed number greater than %d? (%s/%s)
ru: Загаданное число больше %d? (%s/%s)

source: Got the end of input or an error, aborting
ru: Получен конец ввода или ошибка, выключение

source: Please enter just "%s" or just "%s"
ru: Пожалуйста, введите просто "%s" или просто "%s"

source: You guessed %s!
ru: Вы загадали %s!

source: You guessed %d!
ru: Вы загадали %d!
