Repository: Mmi257ia/linux_appdev
Catalog: 12_InstallPackaging/po/*.po
Languages: ru

source: no files were specified
ru: никакие файлы не были указаны

source: just 1 of 3 files specified
ru: указан лишь 1 из 3 файлов

source: just 2 of 3 files specified
ru: указаны лишь 2 из 3 файлов

source: more that 3 files specified, tail is: "%s"
ru: указано более 3 файлов, хвост: "%s"

source: unsupported input type "%s"
ru: неподдерживаемый тип входных матриц: "%s"

source: input type is not specified
ru: тип входных матриц не задан

source: input/output files are not specified
ru: входные/выходные файлы не заданы

source: %s: error while opening file %s
ru: %s: ошибка при открытии файла %s

source: %s: error while reading matrix height from file %s
ru: %s: ошибка при чтении высоты матрицы из файла %s

source: %s: error while reading matrix width from file %s
ru: %s: ошибка при чтении ширины матрицы из файла %s

source: %s: error while allocating %lu bytes for matrix from file %s
ru: %s: ошибка при выделении %lu байт под матрицу из файла %s

source: %s: error while writing matrix height to file %s
ru: %s: ошибка при записи высоты матрицы в файл %s

source: %s: could not write all %lu bytes to file %s
ru: %s: не получилось записать все %lu байт в файл %s

source: %s: width of the left multiplier is %lu, but the height of the right one is %lu!
ru: %s: ширина левого множителя -- %lu, но высота правого -- %lu!

source: %s: height of the left multiplier is %lu, but the height of the output is %lu!
ru: %s: высота левого множителя -- %lu, но высота результата -- %lu!

source: %s: width of the right multiplier is %lu, but the width of the output is %lu!
ru: %s: ширина правого множителя -- %lu, но ширина результата -- %lu!

source: %s: error while allocating %lu bytes for output matrix
ru: %s: ошибка при выделении %lu байт под выходную матрицу

source: Usage:
ru: Использование:

source: [OPTION...]
ru: [ПАРАМЕТР...]

source: Give a short usage message
ru: Вывести короткую подсказку

source: Give this help list
ru: Вывести эту подсказку

source: Print program version
ru: Вывести версию программы

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
ru: Обязательные или необязательные аргументы к длинным опциям также обязательны или необязательны для соответствующих коротких опций.

source: Try `%s --help' or `%s --usage' for more information.
ru: Введите `%s --help' или `%s --usage' для подробностей.

source: Specify input type. Currently supported: `i8`, `f32` and `f64`. [REQUIRED]
ru: Задать тип входных матриц. На данный момент поддерживаются: `i8`, `f32` и `f64`. [ОБЯЗАТЕЛЕН]

source: Binary files with inputs and outputs (comma-separated) [REQUIRED]
ru: Бинарные файлы со входами и выходами (разделены запятыми) [ОБЯЗАТЕЛЕН]

source: Matrix operations runner.vThe only supported operation is matrix multiplication. Supported types: i8 x i8 -> i32, f32 x f32 -> f32, f64 x f64 -> f64.
ru: Исполнитель матричных операций.vЕдинственная поддерживаемая операция -- матричное умножение. Поддерживаемые типы: i8 x i8 -> i32, f32 x f32 -> f32, f64 x f64 -> f64.
